<template>
  <vxe-modal title="用户注册协议" v-model="showPopup" width="800" height="800" resize show-maximize show-minimize show-footer show-confirm-button>
    <template #default>
      <div>一个简洁高效、极致流畅的管理系统模板。一个简洁高效、极致流畅的管理系统模板。一个简洁高效、极致流畅的管理系统模板。一个简洁高效、极致流畅的管理系统模板。一个简洁高效、极致流畅的管理系统模板一个简洁高效、极致流畅的管理系统模板。一个简洁高效、极致流畅的管理系统模板。一个简洁高效、极致流畅的管理系统模板。一个简洁高效、极致流畅的管理系统模板。一个简洁高效、极致流畅的管理系统模板一个简洁高效、极致流畅的管理系统模板。一个简洁高效、极致流畅的管理系统模板。一个简洁高效、极致流畅的管理系统模板。一个简洁高效、极致流畅的管理系统模板。一个简洁高效、极致流畅的管理系统模板一个简洁高效、极致流畅的管理系统模板。一个简洁高效、极致流畅的管理系统模板。一个简洁高效、极致流畅的管理系统模板。一个简洁高效、极致流畅的管理系统模板。一个简洁高效、极致流畅的管理系统模板一个简洁高效、极致流畅的管理系统模板。一个简洁高效、极致流畅的管理系统模板。一个简洁高效、极致流畅的管理系统模板。一个简洁高效、极致流畅的管理系统模板。一个简洁高效、极致流畅的管理系统模板一个简洁高效、极致流畅的管理系统模板。一个简洁高效、极致流畅的管理系统模板。一个简洁高效、极致流畅的管理系统模板。一个简洁高效、极致流畅的管理系统模板。一个简洁高效、极致流畅的管理系统模板一个简洁高效、极致流畅的管理系统模板。一个简洁高效、极致流畅的管理系统模板。一个简洁高效、极致流畅的管理系统模板。一个简洁高效、极致流畅的管理系统模板。一个简洁高效、极致流畅的管理系统模板一个简洁高效、极致流畅的管理系统模板。一个简洁高效、极致流畅的管理系统模板。一个简洁高效、极致流畅的管理系统模板。一个简洁高效、极致流畅的管理系统模板。一个简洁高效、极致流畅的管理系统模板一个简洁高效、极致流畅的管理系统模板。一个简洁高效、极致流畅的管理系统模板。一个简洁高效、极致流畅的管理系统模板。一个简洁高效、极致流畅的管理系统模板。一个简洁高效、极致流畅的管理系统模板一个简洁高效、极致流畅的管理系统模板。一个简洁高效、极致流畅的管理系统模板。一个简洁高效、极致流畅的管理系统模板。一个简洁高效、极致流畅的管理系统模板。一个简洁高效、极致流畅的管理系统模板一个简洁高效、极致流畅的管理系统模板。一个简洁高效、极致流畅的管理系统模板。一个简洁高效、极致流畅的管理系统模板。一个简洁高效、极致流畅的管理系统模板。一个简洁高效、极致流畅的管理系统模板一个简洁高效、极致流畅的管理系统模板。一个简洁高效、极致流畅的管理系统模板。一个简洁高效、极致流畅的管理系统模板。一个简洁高效、极致流畅的管理系统模板。一个简洁高效、极致流畅的管理系统模板一个简洁高效、极致流畅的管理系统模板。一个简洁高效、极致流畅的管理系统模板。一个简洁高效、极致流畅的管理系统模板。一个简洁高效、极致流畅的管理系统模板。一个简洁高效、极致流畅的管理系统模板一个简洁高效、极致流畅的管理系统模板。一个简洁高效、极致流畅的管理系统模板。一个简洁高效、极致流畅的管理系统模板。一个简洁高效、极致流畅的管理系统模板。一个简洁高效、极致流畅的管理系统模板一个简洁高效、极致流畅的管理系统模板。一个简洁高效、极致流畅的管理系统模板。一个简洁高效、极致流畅的管理系统模板。一个简洁高效、极致流畅的管理系统模板。一个简洁高效、极致流畅的管理系统模板一个简洁高效、极致流畅的管理系统模板。一个简洁高效、极致流畅的管理系统模板。一个简洁高效、极致流畅的管理系统模板。一个简洁高效、极致流畅的管理系统模板。一个简洁高效、极致流畅的管理系统模板一个简洁高效、极致流畅的管理系统模板。一个简洁高效、极致流畅的管理系统模板。一个简洁高效、极致流畅的管理系统模板。一个简洁高效、极致流畅的管理系统模板。一个简洁高效、极致流畅的管理系统模板一个简洁高效、极致流畅的管理系统模板。一个简洁高效、极致流畅的管理系统模板。一个简洁高效、极致流畅的管理系统模板。一个简洁高效、极致流畅的管理系统模板。一个简洁高效、极致流畅的管理系统模板一个简洁高效、极致流畅的管理系统模板。一个简洁高效、极致流畅的管理系统模板。一个简洁高效、极致流畅的管理系统模板。一个简洁高效、极致流畅的管理系统模板。一个简洁高效、极致流畅的管理系统模板一个简洁高效、极致流畅的管理系统模板。一个简洁高效、极致流畅的管理系统模板。一个简洁高效、极致流畅的管理系统模板。一个简洁高效、极致流畅的管理系统模板。一个简洁高效、极致流畅的管理系统模板</div>
    </template>
  </vxe-modal>
</template>

<script>
export default {
  data () {
    const showPopup = false

    return {
      showPopup
    }
  },
  methods: {
    open () {
      this.showPopup = true
    }
  }
}
</script>
